Autodesk.Revit.DB.Structure.FabricWireItem.Distance
Distance to the next fabric wire item
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for distance is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for distance must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2017